#!usr/bin/env python
#coding: utf-8
'''
Created on Jun 27, 2012

@author: dashan.yin
'''

# 用户权限字典
account_usertype_dict = {0:u'普通用户', 1:u'供应商', 2:u'普通管理员', 3:u'超级管理员'}

# 日志级别字典
log_level_dict = {0:'DEBUG', 1:'INFO', 2:'WARN', 3:'ERROR'}

# 日志类型字典
log_type_dict = {0:u'其他日志', 1:u'运营商日志', 2:u'机房日志', 3:u'机架日志', 4:u'物理机日志', 5:u'虚拟机日志'}

# 公告类型字典
notice_type_dict = {0:u'全部', 1:u'招标公告', 2:u'中标公告', 3:u'招标变更', 4:u'预审公告', 5:u'电力项目', 6:u'重点工程', 7:u'法规中心', 8:u'标书下载', 9:u'招标新闻'}

# 所属地区字典
notice_area_dict = {0:u'全部', 
                    1:u'北京', 
                    2:u'天津', 
                    3:u'上海', 
                    4:u'重庆', 
                    5:u'河北', 
                    6:u'山西', 
                    7:u'内蒙古', 
                    8:u'辽宁', 
                    9:u'吉林', 
                    10:u'黑龙江', 
                    11:u'江苏', 
                    12:u'浙江', 
                    13:u'安徽', 
                    14:u'福建', 
                    15:u'江西', 
                    16:u'山东', 
                    17:u'河南', 
                    18:u'湖北', 
                    19:u'湖南', 
                    20:u'广东', 
                    21:u'广西', 
                    22:u'海南', 
                    23:u'四川', 
                    24:u'贵州', 
                    25:u'云南', 
                    26:u'西藏', 
                    27:u'陕西', 
                    28:u'甘肃', 
                    29:u'青海', 
                    30:u'宁夏', 
                    31:u'新疆', 
                    32:u'香港', 
                    33:u'澳门', 
                    34:u'台湾省', 
                    35:u'海南'}



# 日期范围字典
date_range_dict = {0:u'全部', 1:u'近一天', 7:u'近一周', 30:u'近一月', 365:u'近一年'}









